[Timeout] BlockStatement
src/middleware/authMiddleware.js:3:37
 const jwt = require("jsonwebtoken");
 
-const protect = (req, res, next) => {
-  let token;
-
-  if (req.headers.authorization && req.headers.authorization.startsWith("Bearer")) {
-    try {
-      token = req.headers.authorization.split(" ")[1];
-
-      const decoded = jwt.verify(token, process.env.JWT_SECRET);
-
-      // Explicit expiry check
-      if (decoded.exp * 1000 < Date.now()) {
-        return res.status(401).json({ message: "Token expired" });
-      }
-
-      req.user = decoded;
-      next();
-    } catch (err) {
-      return res.status(401).json({ message: "Not authorised – invalid token" });
-    }
-  }
-
-  if (!token) {
-    return res.status(401).json({ message: "Not authorised – no token" });
-  }
-};
+const protect = (req, res, next) => {};
 
 const adminOnly = (req, res, next) => {

[NoCoverage] MethodExpression
src/middleware/authMiddleware.js:6:36
 const protect = (req, res, next) => {
   let token;
 
-  if (req.headers.authorization && req.headers.authorization.startsWith("Bearer")) {
+  if (req.headers.authorization && req.headers.authorization.endsWith("Bearer")) {
     try {
       token = req.headers.authorization.split(" ")[1];

[Timeout] ConditionalExpression
src/middleware/authMiddleware.js:6:7
 const protect = (req, res, next) => {
   let token;
 
-  if (req.headers.authorization && req.headers.authorization.startsWith("Bearer")) {
+  if (false) {
     try {
       token = req.headers.authorization.split(" ")[1];

[NoCoverage] BlockStatement
src/middleware/authMiddleware.js:7:9
   let token;
 
   if (req.headers.authorization && req.headers.authorization.startsWith("Bearer")) {
-    try {
-      token = req.headers.authorization.split(" ")[1];
-
-      const decoded = jwt.verify(token, process.env.JWT_SECRET);
-
-      // Explicit expiry check
-      if (decoded.exp * 1000 < Date.now()) {
-        return res.status(401).json({ message: "Token expired" });
-      }
-
-      req.user = decoded;
-      next();
-    } catch (err) {
+    try {} catch (err) {
       return res.status(401).json({ message: "Not authorised – invalid token" });
     }

[NoCoverage] EqualityOperator
src/middleware/authMiddleware.js:13:11
       const decoded = jwt.verify(token, process.env.JWT_SECRET);
 
       // Explicit expiry check
-      if (decoded.exp * 1000 < Date.now()) {
+      if (decoded.exp * 1000 >= Date.now()) {
         return res.status(401).json({ message: "Token expired" });
       }

[NoCoverage] ConditionalExpression
src/middleware/authMiddleware.js:13:11
       const decoded = jwt.verify(token, process.env.JWT_SECRET);
 
       // Explicit expiry check
-      if (decoded.exp * 1000 < Date.now()) {
+      if (false) {
         return res.status(401).json({ message: "Token expired" });
       }

[NoCoverage] StringLiteral
src/middleware/authMiddleware.js:14:48
 
       // Explicit expiry check
       if (decoded.exp * 1000 < Date.now()) {
-        return res.status(401).json({ message: "Token expired" });
+        return res.status(401).json({ message: "" });
       }
 

[NoCoverage] BlockStatement
src/middleware/authMiddleware.js:19:19
 
       req.user = decoded;
       next();
-    } catch (err) {
-      return res.status(401).json({ message: "Not authorised – invalid token" });
-    }
+    } catch (err) {}
   }
 

[Timeout] BooleanLiteral
src/middleware/authMiddleware.js:24:7
     }
   }
 
-  if (!token) {
+  if (token) {
     return res.status(401).json({ message: "Not authorised – no token" });
   }

[Timeout] ConditionalExpression
src/middleware/authMiddleware.js:24:7
     }
   }
 
-  if (!token) {
+  if (true) {
     return res.status(401).json({ message: "Not authorised – no token" });
   }

[Survived] StringLiteral
src/middleware/authMiddleware.js:25:44
   }
 
   if (!token) {
-    return res.status(401).json({ message: "Not authorised – no token" });
+    return res.status(401).json({ message: "" });
   }
 };

[NoCoverage] BlockStatement
src/middleware/authMiddleware.js:29:39
   }
 };
 
-const adminOnly = (req, res, next) => {
-  if (req.user && req.user.role === "admin") {
-    next();
-  } else {
-    res.status(403).json({ message: "Admin access only" });
-  }
-};
+const adminOnly = (req, res, next) => {};
 
 module.exports = { protect, adminOnly };

[NoCoverage] ConditionalExpression
src/middleware/authMiddleware.js:30:7
 };
 
 const adminOnly = (req, res, next) => {
-  if (req.user && req.user.role === "admin") {
+  if (true) {
     next();
   } else {

[NoCoverage] EqualityOperator
src/middleware/authMiddleware.js:30:19
 };
 
 const adminOnly = (req, res, next) => {
-  if (req.user && req.user.role === "admin") {
+  if (req.user && req.user.role !== "admin") {
     next();
   } else {

[NoCoverage] BlockStatement
src/middleware/authMiddleware.js:32:10
 const adminOnly = (req, res, next) => {
   if (req.user && req.user.role === "admin") {
     next();
-  } else {
-    res.status(403).json({ message: "Admin access only" });
-  }
+  } else {}
 };
 
