[NoCoverage] ConditionalExpression
src/services/dietService.js:5:5
   const { weight, height, age, gender, goal } = user;
 
   let bmr =
-    gender === "female"
+    true
       ? 10 * weight + 6.25 * height - 5 * age - 161
       : 10 * weight + 6.25 * height - 5 * age + 5;

[NoCoverage] ConditionalExpression
src/services/dietService.js:5:5
   const { weight, height, age, gender, goal } = user;
 
   let bmr =
-    gender === "female"
+    false
       ? 10 * weight + 6.25 * height - 5 * age - 161
       : 10 * weight + 6.25 * height - 5 * age + 5;

[NoCoverage] ArithmeticOperator
src/services/dietService.js:6:9
 
   let bmr =
     gender === "female"
-      ? 10 * weight + 6.25 * height - 5 * age - 161
+      ? 10 * weight - 6.25 * height - 5 * age - 161
       : 10 * weight + 6.25 * height - 5 * age + 5;
 

[NoCoverage] ArithmeticOperator
src/services/dietService.js:6:39
 
   let bmr =
     gender === "female"
-      ? 10 * weight + 6.25 * height - 5 * age - 161
+      ? 10 * weight + 6.25 * height - 5 / age - 161
       : 10 * weight + 6.25 * height - 5 * age + 5;
 

[NoCoverage] ArithmeticOperator
src/services/dietService.js:7:9
   let bmr =
     gender === "female"
       ? 10 * weight + 6.25 * height - 5 * age - 161
-      : 10 * weight + 6.25 * height - 5 * age + 5;
+      : 10 * weight + 6.25 * height + 5 * age + 5;
 
   const tdee = bmr * 1.55;

[NoCoverage] ArithmeticOperator
src/services/dietService.js:7:9
   let bmr =
     gender === "female"
       ? 10 * weight + 6.25 * height - 5 * age - 161
-      : 10 * weight + 6.25 * height - 5 * age + 5;
+      : 10 * weight + 6.25 * height - 5 * age - 5;
 
   const tdee = bmr * 1.55;

[NoCoverage] ArithmeticOperator
src/services/dietService.js:9:16
       ? 10 * weight + 6.25 * height - 5 * age - 161
       : 10 * weight + 6.25 * height - 5 * age + 5;
 
-  const tdee = bmr * 1.55;
+  const tdee = bmr / 1.55;
 
   let calories, protein, fat, carbs;

[NoCoverage] BlockStatement
src/services/dietService.js:13:31
 
   let calories, protein, fat, carbs;
 
-  if (goal === "muscle_gain") {
-    calories = tdee + 300;
-    protein = weight * 2.2;
-    fat = weight * 1.2;
-  } else if (goal === "weight_loss") {
+  if (goal === "muscle_gain") {} else if (goal === "weight_loss") {
     calories = tdee - 400;
     protein = weight * 2.0;

[NoCoverage] EqualityOperator
src/services/dietService.js:13:7
 
   let calories, protein, fat, carbs;
 
-  if (goal === "muscle_gain") {
+  if (goal !== "muscle_gain") {
     calories = tdee + 300;
     protein = weight * 2.2;

[NoCoverage] ArithmeticOperator
src/services/dietService.js:14:16
   let calories, protein, fat, carbs;
 
   if (goal === "muscle_gain") {
-    calories = tdee + 300;
+    calories = tdee - 300;
     protein = weight * 2.2;
     fat = weight * 1.2;

[NoCoverage] ArithmeticOperator
src/services/dietService.js:15:15
 
   if (goal === "muscle_gain") {
     calories = tdee + 300;
-    protein = weight * 2.2;
+    protein = weight / 2.2;
     fat = weight * 1.2;
   } else if (goal === "weight_loss") {

[NoCoverage] ArithmeticOperator
src/services/dietService.js:16:11
   if (goal === "muscle_gain") {
     calories = tdee + 300;
     protein = weight * 2.2;
-    fat = weight * 1.2;
+    fat = weight / 1.2;
   } else if (goal === "weight_loss") {
     calories = tdee - 400;

[NoCoverage] ConditionalExpression
src/services/dietService.js:17:14
     calories = tdee + 300;
     protein = weight * 2.2;
     fat = weight * 1.2;
-  } else if (goal === "weight_loss") {
+  } else if (true) {
     calories = tdee - 400;
     protein = weight * 2.0;

[NoCoverage] ConditionalExpression
src/services/dietService.js:17:14
     calories = tdee + 300;
     protein = weight * 2.2;
     fat = weight * 1.2;
-  } else if (goal === "weight_loss") {
+  } else if (false) {
     calories = tdee - 400;
     protein = weight * 2.0;

[NoCoverage] ArithmeticOperator
src/services/dietService.js:18:16
     protein = weight * 2.2;
     fat = weight * 1.2;
   } else if (goal === "weight_loss") {
-    calories = tdee - 400;
+    calories = tdee + 400;
     protein = weight * 2.0;
     fat = weight * 0.9;

[NoCoverage] ArithmeticOperator
src/services/dietService.js:19:15
     fat = weight * 1.2;
   } else if (goal === "weight_loss") {
     calories = tdee - 400;
-    protein = weight * 2.0;
+    protein = weight / 2.0;
     fat = weight * 0.9;
   } else {

[NoCoverage] ArithmeticOperator
src/services/dietService.js:20:11
   } else if (goal === "weight_loss") {
     calories = tdee - 400;
     protein = weight * 2.0;
-    fat = weight * 0.9;
+    fat = weight / 0.9;
   } else {
     calories = tdee;

[NoCoverage] BlockStatement
src/services/dietService.js:21:10
     calories = tdee - 400;
     protein = weight * 2.0;
     fat = weight * 0.9;
-  } else {
-    calories = tdee;
-    protein = weight * 1.8;
-    fat = weight * 1.0;
-  }
+  } else {}
 
   carbs = (calories - protein * 4 - fat * 9) / 4;

[NoCoverage] ArithmeticOperator
src/services/dietService.js:23:15
     fat = weight * 0.9;
   } else {
     calories = tdee;
-    protein = weight * 1.8;
+    protein = weight / 1.8;
     fat = weight * 1.0;
   }

[NoCoverage] ArithmeticOperator
src/services/dietService.js:24:11
   } else {
     calories = tdee;
     protein = weight * 1.8;
-    fat = weight * 1.0;
+    fat = weight / 1.0;
   }
 

[NoCoverage] ArithmeticOperator
src/services/dietService.js:27:12
     fat = weight * 1.0;
   }
 
-  carbs = (calories - protein * 4 - fat * 9) / 4;
+  carbs = (calories - protein * 4 + fat * 9) / 4;
   if (carbs < 50) carbs = 50;
 

[NoCoverage] ArithmeticOperator
src/services/dietService.js:27:23
     fat = weight * 1.0;
   }
 
-  carbs = (calories - protein * 4 - fat * 9) / 4;
+  carbs = (calories - protein / 4 - fat * 9) / 4;
   if (carbs < 50) carbs = 50;
 

[NoCoverage] EqualityOperator
src/services/dietService.js:28:7
   }
 
   carbs = (calories - protein * 4 - fat * 9) / 4;
-  if (carbs < 50) carbs = 50;
+  if (carbs <= 50) carbs = 50;
 
   return { calories, protein, carbs, fat, tdee, bmr };

[NoCoverage] EqualityOperator
src/services/dietService.js:28:7
   }
 
   carbs = (calories - protein * 4 - fat * 9) / 4;
-  if (carbs < 50) carbs = 50;
+  if (carbs >= 50) carbs = 50;
 
   return { calories, protein, carbs, fat, tdee, bmr };

[NoCoverage] BlockStatement
src/services/dietService.js:33:31
   return { calories, protein, carbs, fat, tdee, bmr };
 };
 
-const getDietPlan = (user) => {
-  const macros = calculateMacros(user);
-
-  return {
-    macros,
-    meals: [
-      { time: "7:00", type: "Pre-workout", foods: [{ name: "Oats", calories: 420 }] },
-      { time: "10:30", type: "Post-workout", foods: [{ name: "Whey Protein", calories: 160 }] },
-      { time: "13:00", type: "Lunch", foods: [{ name: "Chicken & Rice", calories: 500 }] },
-      { time: "16:00", type: "Snack", foods: [{ name: "Yogurt", calories: 130 }] },
-      { time: "20:00", type: "Dinner", foods: [{ name: "Salmon", calories: 350 }] }
-    ]
-  };
-};
+const getDietPlan = (user) => {};
 
 module.exports = { calculateMacros, getDietPlan };

[NoCoverage] ArrayDeclaration
src/services/dietService.js:38:12
 
   return {
     macros,
-    meals: [
-      { time: "7:00", type: "Pre-workout", foods: [{ name: "Oats", calories: 420 }] },
-      { time: "10:30", type: "Post-workout", foods: [{ name: "Whey Protein", calories: 160 }] },
-      { time: "13:00", type: "Lunch", foods: [{ name: "Chicken & Rice", calories: 500 }] },
-      { time: "16:00", type: "Snack", foods: [{ name: "Yogurt", calories: 130 }] },
-      { time: "20:00", type: "Dinner", foods: [{ name: "Salmon", calories: 350 }] }
-    ]
+    meals: []
   };
 };

[NoCoverage] ObjectLiteral
src/services/dietService.js:39:7
   return {
     macros,
     meals: [
-      { time: "7:00", type: "Pre-workout", foods: [{ name: "Oats", calories: 420 }] },
+      {},
       { time: "10:30", type: "Post-workout", foods: [{ name: "Whey Protein", calories: 160 }] },
       { time: "13:00", type: "Lunch", foods: [{ name: "Chicken & Rice", calories: 500 }] },

[NoCoverage] StringLiteral
src/services/dietService.js:40:15
     macros,
     meals: [
       { time: "7:00", type: "Pre-workout", foods: [{ name: "Oats", calories: 420 }] },
-      { time: "10:30", type: "Post-workout", foods: [{ name: "Whey Protein", calories: 160 }] },
+      { time: "", type: "Post-workout", foods: [{ name: "Whey Protein", calories: 160 }] },
       { time: "13:00", type: "Lunch", foods: [{ name: "Chicken & Rice", calories: 500 }] },
       { time: "16:00", type: "Snack", foods: [{ name: "Yogurt", calories: 130 }] },

[NoCoverage] ObjectLiteral
src/services/dietService.js:40:7
     macros,
     meals: [
       { time: "7:00", type: "Pre-workout", foods: [{ name: "Oats", calories: 420 }] },
-      { time: "10:30", type: "Post-workout", foods: [{ name: "Whey Protein", calories: 160 }] },
+      {},
       { time: "13:00", type: "Lunch", foods: [{ name: "Chicken & Rice", calories: 500 }] },
       { time: "16:00", type: "Snack", foods: [{ name: "Yogurt", calories: 130 }] },

[NoCoverage] ArrayDeclaration
src/services/dietService.js:41:46
     meals: [
       { time: "7:00", type: "Pre-workout", foods: [{ name: "Oats", calories: 420 }] },
       { time: "10:30", type: "Post-workout", foods: [{ name: "Whey Protein", calories: 160 }] },
-      { time: "13:00", type: "Lunch", foods: [{ name: "Chicken & Rice", calories: 500 }] },
+      { time: "13:00", type: "Lunch", foods: [] },
       { time: "16:00", type: "Snack", foods: [{ name: "Yogurt", calories: 130 }] },
       { time: "20:00", type: "Dinner", foods: [{ name: "Salmon", calories: 350 }] }

[NoCoverage] StringLiteral
src/services/dietService.js:41:15
     meals: [
       { time: "7:00", type: "Pre-workout", foods: [{ name: "Oats", calories: 420 }] },
       { time: "10:30", type: "Post-workout", foods: [{ name: "Whey Protein", calories: 160 }] },
-      { time: "13:00", type: "Lunch", foods: [{ name: "Chicken & Rice", calories: 500 }] },
+      { time: "", type: "Lunch", foods: [{ name: "Chicken & Rice", calories: 500 }] },
       { time: "16:00", type: "Snack", foods: [{ name: "Yogurt", calories: 130 }] },
       { time: "20:00", type: "Dinner", foods: [{ name: "Salmon", calories: 350 }] }

[NoCoverage] StringLiteral
src/services/dietService.js:42:15
       { time: "7:00", type: "Pre-workout", foods: [{ name: "Oats", calories: 420 }] },
       { time: "10:30", type: "Post-workout", foods: [{ name: "Whey Protein", calories: 160 }] },
       { time: "13:00", type: "Lunch", foods: [{ name: "Chicken & Rice", calories: 500 }] },
-      { time: "16:00", type: "Snack", foods: [{ name: "Yogurt", calories: 130 }] },
+      { time: "", type: "Snack", foods: [{ name: "Yogurt", calories: 130 }] },
       { time: "20:00", type: "Dinner", foods: [{ name: "Salmon", calories: 350 }] }
     ]

[NoCoverage] ObjectLiteral
src/services/dietService.js:42:47
       { time: "7:00", type: "Pre-workout", foods: [{ name: "Oats", calories: 420 }] },
       { time: "10:30", type: "Post-workout", foods: [{ name: "Whey Protein", calories: 160 }] },
       { time: "13:00", type: "Lunch", foods: [{ name: "Chicken & Rice", calories: 500 }] },
-      { time: "16:00", type: "Snack", foods: [{ name: "Yogurt", calories: 130 }] },
+      { time: "16:00", type: "Snack", foods: [{}] },
       { time: "20:00", type: "Dinner", foods: [{ name: "Salmon", calories: 350 }] }
     ]

[NoCoverage] ArrayDeclaration
src/services/dietService.js:43:47
       { time: "10:30", type: "Post-workout", foods: [{ name: "Whey Protein", calories: 160 }] },
       { time: "13:00", type: "Lunch", foods: [{ name: "Chicken & Rice", calories: 500 }] },
       { time: "16:00", type: "Snack", foods: [{ name: "Yogurt", calories: 130 }] },
-      { time: "20:00", type: "Dinner", foods: [{ name: "Salmon", calories: 350 }] }
+      { time: "20:00", type: "Dinner", foods: [] }
     ]
   };
