[NoCoverage] BlockStatement
src/services/progressService.js:3:40
 const WorkoutLog = require("../models/WorkoutLog");
 
-const getWeeklyStats = async (user) => {
-  const logs = await WorkoutLog.find({ user });
-
-  const totalCalories = logs.reduce((sum, l) => sum + (l.calories || 0), 0);
-  const totalDuration = logs.reduce((sum, l) => sum + (l.duration || 0), 0);
-  const totalVolume = logs.reduce((sum, l) => sum + (l.totalVolume || 0), 0);
-
-  return {
-    sessionsThisWeek: logs.length,
-    totalCalories,
-    totalDuration,
-    totalVolume
-  };
-};
+const getWeeklyStats = async (user) => {};
 
 const getProgressChart = async (user, weeks = 8) => {

[NoCoverage] ObjectLiteral
src/services/progressService.js:4:38
 const WorkoutLog = require("../models/WorkoutLog");
 
 const getWeeklyStats = async (user) => {
-  const logs = await WorkoutLog.find({ user });
+  const logs = await WorkoutLog.find({});
 
   const totalCalories = logs.reduce((sum, l) => sum + (l.calories || 0), 0);

[NoCoverage] LogicalOperator
src/services/progressService.js:6:56
 const getWeeklyStats = async (user) => {
   const logs = await WorkoutLog.find({ user });
 
-  const totalCalories = logs.reduce((sum, l) => sum + (l.calories || 0), 0);
+  const totalCalories = logs.reduce((sum, l) => sum + (l.calories && 0), 0);
   const totalDuration = logs.reduce((sum, l) => sum + (l.duration || 0), 0);
   const totalVolume = logs.reduce((sum, l) => sum + (l.totalVolume || 0), 0);

[NoCoverage] ArithmeticOperator
src/services/progressService.js:6:49
 const getWeeklyStats = async (user) => {
   const logs = await WorkoutLog.find({ user });
 
-  const totalCalories = logs.reduce((sum, l) => sum + (l.calories || 0), 0);
+  const totalCalories = logs.reduce((sum, l) => sum - (l.calories || 0), 0);
   const totalDuration = logs.reduce((sum, l) => sum + (l.duration || 0), 0);
   const totalVolume = logs.reduce((sum, l) => sum + (l.totalVolume || 0), 0);

[NoCoverage] ArithmeticOperator
src/services/progressService.js:7:49
   const logs = await WorkoutLog.find({ user });
 
   const totalCalories = logs.reduce((sum, l) => sum + (l.calories || 0), 0);
-  const totalDuration = logs.reduce((sum, l) => sum + (l.duration || 0), 0);
+  const totalDuration = logs.reduce((sum, l) => sum - (l.duration || 0), 0);
   const totalVolume = logs.reduce((sum, l) => sum + (l.totalVolume || 0), 0);
 

[NoCoverage] ArrowFunction
src/services/progressService.js:7:37
   const logs = await WorkoutLog.find({ user });
 
   const totalCalories = logs.reduce((sum, l) => sum + (l.calories || 0), 0);
-  const totalDuration = logs.reduce((sum, l) => sum + (l.duration || 0), 0);
+  const totalDuration = logs.reduce(() => undefined, 0);
   const totalVolume = logs.reduce((sum, l) => sum + (l.totalVolume || 0), 0);
 

[NoCoverage] ConditionalExpression
src/services/progressService.js:8:54
 
   const totalCalories = logs.reduce((sum, l) => sum + (l.calories || 0), 0);
   const totalDuration = logs.reduce((sum, l) => sum + (l.duration || 0), 0);
-  const totalVolume = logs.reduce((sum, l) => sum + (l.totalVolume || 0), 0);
+  const totalVolume = logs.reduce((sum, l) => sum + (true), 0);
 
   return {

[NoCoverage] LogicalOperator
src/services/progressService.js:8:54
 
   const totalCalories = logs.reduce((sum, l) => sum + (l.calories || 0), 0);
   const totalDuration = logs.reduce((sum, l) => sum + (l.duration || 0), 0);
-  const totalVolume = logs.reduce((sum, l) => sum + (l.totalVolume || 0), 0);
+  const totalVolume = logs.reduce((sum, l) => sum + (l.totalVolume && 0), 0);
 
   return {

[NoCoverage] ObjectLiteral
src/services/progressService.js:10:10
   const totalDuration = logs.reduce((sum, l) => sum + (l.duration || 0), 0);
   const totalVolume = logs.reduce((sum, l) => sum + (l.totalVolume || 0), 0);
 
-  return {
-    sessionsThisWeek: logs.length,
-    totalCalories,
-    totalDuration,
-    totalVolume
-  };
+  return {};
 };
 

[NoCoverage] BlockStatement
src/services/progressService.js:18:53
   };
 };
 
-const getProgressChart = async (user, weeks = 8) => {
-  const logs = await WorkoutLog.find({ user });
-
-  const data = [];
-  for (let i = 0; i < weeks; i++) {
-    data.push({
-      week: i + 1,
-      volume: logs.reduce((sum, l) => sum + (l.totalVolume || 0), 0),
-      sessions: logs.length
-    });
-  }
-  return data;
-};
+const getProgressChart = async (user, weeks = 8) => {};
 
 const getMuscleStrength = async (user) => {

[NoCoverage] ObjectLiteral
src/services/progressService.js:19:38
 };
 
 const getProgressChart = async (user, weeks = 8) => {
-  const logs = await WorkoutLog.find({ user });
+  const logs = await WorkoutLog.find({});
 
   const data = [];

[NoCoverage] EqualityOperator
src/services/progressService.js:22:19
   const logs = await WorkoutLog.find({ user });
 
   const data = [];
-  for (let i = 0; i < weeks; i++) {
+  for (let i = 0; i >= weeks; i++) {
     data.push({
       week: i + 1,

[NoCoverage] ConditionalExpression
src/services/progressService.js:22:19
   const logs = await WorkoutLog.find({ user });
 
   const data = [];
-  for (let i = 0; i < weeks; i++) {
+  for (let i = 0; false; i++) {
     data.push({
       week: i + 1,

[NoCoverage] ObjectLiteral
src/services/progressService.js:23:15
 
   const data = [];
   for (let i = 0; i < weeks; i++) {
-    data.push({
-      week: i + 1,
-      volume: logs.reduce((sum, l) => sum + (l.totalVolume || 0), 0),
-      sessions: logs.length
-    });
+    data.push({});
   }
   return data;

[NoCoverage] ArithmeticOperator
src/services/progressService.js:24:13
   const data = [];
   for (let i = 0; i < weeks; i++) {
     data.push({
-      week: i + 1,
+      week: i - 1,
       volume: logs.reduce((sum, l) => sum + (l.totalVolume || 0), 0),
       sessions: logs.length

[NoCoverage] LogicalOperator
src/services/progressService.js:25:46
   for (let i = 0; i < weeks; i++) {
     data.push({
       week: i + 1,
-      volume: logs.reduce((sum, l) => sum + (l.totalVolume || 0), 0),
+      volume: logs.reduce((sum, l) => sum + (l.totalVolume && 0), 0),
       sessions: logs.length
     });

[NoCoverage] ArithmeticOperator
src/services/progressService.js:25:39
   for (let i = 0; i < weeks; i++) {
     data.push({
       week: i + 1,
-      volume: logs.reduce((sum, l) => sum + (l.totalVolume || 0), 0),
+      volume: logs.reduce((sum, l) => sum - (l.totalVolume || 0), 0),
       sessions: logs.length
     });

[NoCoverage] BlockStatement
src/services/progressService.js:32:43
   return data;
 };
 
-const getMuscleStrength = async (user) => {
-  const logs = await WorkoutLog.find({ user });
-
-  const result = {};
-
-  logs.forEach((log) => {
-    log.exercises.forEach((ex) => {
-      const group = ex.muscleGroup;
-      if (!result[group]) {
-        result[group] = { maxWeight: 0, sessions: 0 };
-      }
-
-      ex.sets.forEach((set) => {
-        if (set.weight > result[group].maxWeight) {
-          result[group].maxWeight = set.weight;
-        }
-      });
-
-      result[group].sessions += 1;
-    });
-  });
-
-  return result;
-};
+const getMuscleStrength = async (user) => {};
 
 const getAdherence = async (user, target = 4) => {

[NoCoverage] ObjectLiteral
src/services/progressService.js:33:38
 };
 
 const getMuscleStrength = async (user) => {
-  const logs = await WorkoutLog.find({ user });
+  const logs = await WorkoutLog.find({});
 
   const result = {};

[NoCoverage] BlockStatement
src/services/progressService.js:37:25
 
   const result = {};
 
-  logs.forEach((log) => {
-    log.exercises.forEach((ex) => {
-      const group = ex.muscleGroup;
-      if (!result[group]) {
-        result[group] = { maxWeight: 0, sessions: 0 };
-      }
-
-      ex.sets.forEach((set) => {
-        if (set.weight > result[group].maxWeight) {
-          result[group].maxWeight = set.weight;
-        }
-      });
-
-      result[group].sessions += 1;
-    });
-  });
+  logs.forEach((log) => {});
 
   return result;

[NoCoverage] BlockStatement
src/services/progressService.js:38:35
   const result = {};
 
   logs.forEach((log) => {
-    log.exercises.forEach((ex) => {
-      const group = ex.muscleGroup;
-      if (!result[group]) {
-        result[group] = { maxWeight: 0, sessions: 0 };
-      }
-
-      ex.sets.forEach((set) => {
-        if (set.weight > result[group].maxWeight) {
-          result[group].maxWeight = set.weight;
-        }
-      });
-
-      result[group].sessions += 1;
-    });
+    log.exercises.forEach((ex) => {});
   });
 

[NoCoverage] ConditionalExpression
src/services/progressService.js:40:11
   logs.forEach((log) => {
     log.exercises.forEach((ex) => {
       const group = ex.muscleGroup;
-      if (!result[group]) {
+      if (false) {
         result[group] = { maxWeight: 0, sessions: 0 };
       }

[NoCoverage] BlockStatement
src/services/progressService.js:40:27
   logs.forEach((log) => {
     log.exercises.forEach((ex) => {
       const group = ex.muscleGroup;
-      if (!result[group]) {
-        result[group] = { maxWeight: 0, sessions: 0 };
-      }
+      if (!result[group]) {}
 
       ex.sets.forEach((set) => {

[NoCoverage] ObjectLiteral
src/services/progressService.js:41:25
     log.exercises.forEach((ex) => {
       const group = ex.muscleGroup;
       if (!result[group]) {
-        result[group] = { maxWeight: 0, sessions: 0 };
+        result[group] = {};
       }
 

[NoCoverage] BlockStatement
src/services/progressService.js:44:32
         result[group] = { maxWeight: 0, sessions: 0 };
       }
 
-      ex.sets.forEach((set) => {
-        if (set.weight > result[group].maxWeight) {
-          result[group].maxWeight = set.weight;
-        }
-      });
+      ex.sets.forEach((set) => {});
 
       result[group].sessions += 1;

[NoCoverage] EqualityOperator
src/services/progressService.js:45:13
       }
 
       ex.sets.forEach((set) => {
-        if (set.weight > result[group].maxWeight) {
+        if (set.weight <= result[group].maxWeight) {
           result[group].maxWeight = set.weight;
         }

[NoCoverage] EqualityOperator
src/services/progressService.js:45:13
       }
 
       ex.sets.forEach((set) => {
-        if (set.weight > result[group].maxWeight) {
+        if (set.weight >= result[group].maxWeight) {
           result[group].maxWeight = set.weight;
         }

[NoCoverage] AssignmentOperator
src/services/progressService.js:50:7
         }
       });
 
-      result[group].sessions += 1;
+      result[group].sessions -= 1;
     });
   });

[NoCoverage] BlockStatement
src/services/progressService.js:57:50
   return result;
 };
 
-const getAdherence = async (user, target = 4) => {
-  const logs = await WorkoutLog.find({ user });
-  const count = logs.length;
-
-  const rate = Math.min((count / target) * 100, 100);
-
-  return { count, target, rate };
-};
+const getAdherence = async (user, target = 4) => {};
 
 module.exports = {

[NoCoverage] MethodExpression
src/services/progressService.js:61:16
   const logs = await WorkoutLog.find({ user });
   const count = logs.length;
 
-  const rate = Math.min((count / target) * 100, 100);
+  const rate = Math.max(count / target * 100, 100);
 
   return { count, target, rate };

[NoCoverage] ArithmeticOperator
src/services/progressService.js:61:26
   const logs = await WorkoutLog.find({ user });
   const count = logs.length;
 
-  const rate = Math.min((count / target) * 100, 100);
+  const rate = Math.min((count * target) * 100, 100);
 
   return { count, target, rate };
