[Timeout] BlockStatement
src/services/authService.js:5:34
 const bcrypt = require("bcryptjs");
 const jwt = require("jsonwebtoken");
 
-const generateTokens = (user) => {
-  const accessToken = jwt.sign(
-    { id: user._id, role: user.role },
-    process.env.JWT_SECRET,
-    { expiresIn: process.env.JWT_EXPIRES_IN }
-  );
-
-  const refreshToken = jwt.sign(
-    { id: user._id },
-    process.env.JWT_REFRESH_SECRET,
-    { expiresIn: process.env.JWT_REFRESH_EXPIRES_IN }
-  );
-
-  return { accessToken, refreshToken };
-};
+const generateTokens = (user) => {};
 
 const register = async (data) => {

[Timeout] BlockStatement
src/services/authService.js:21:34
   return { accessToken, refreshToken };
 };
 
-const register = async (data) => {
-  const { email, password } = data;
-
-  if (password.length < 8) throw new Error("Password too short");
-
-  const exists = await User.findOne({ email });
-  if (exists) throw new Error("User already exists");
-
-  const user = await User.create(data);
-
-  const tokens = generateTokens(user);
-  user.refreshToken = tokens.refreshToken;
-  await user.save();
-
-  return { user, ...tokens };
-};
+const register = async (data) => {};
 
 const login = async (email, password) => {

[Timeout] ConditionalExpression
src/services/authService.js:24:7
 const register = async (data) => {
   const { email, password } = data;
 
-  if (password.length < 8) throw new Error("Password too short");
+  if (false) throw new Error("Password too short");
 
   const exists = await User.findOne({ email });

[Timeout] ConditionalExpression
src/services/authService.js:24:7
 const register = async (data) => {
   const { email, password } = data;
 
-  if (password.length < 8) throw new Error("Password too short");
+  if (true) throw new Error("Password too short");
 
   const exists = await User.findOne({ email });

[Timeout] ConditionalExpression
src/services/authService.js:27:7
   if (password.length < 8) throw new Error("Password too short");
 
   const exists = await User.findOne({ email });
-  if (exists) throw new Error("User already exists");
+  if (true) throw new Error("User already exists");
 
   const user = await User.create(data);

[Timeout] ConditionalExpression
src/services/authService.js:27:7
   if (password.length < 8) throw new Error("Password too short");
 
   const exists = await User.findOne({ email });
-  if (exists) throw new Error("User already exists");
+  if (false) throw new Error("User already exists");
 
   const user = await User.create(data);

[Timeout] ObjectLiteral
src/services/authService.js:35:10
   user.refreshToken = tokens.refreshToken;
   await user.save();
 
-  return { user, ...tokens };
+  return {};
 };
 

[NoCoverage] BlockStatement
src/services/authService.js:38:42
   return { user, ...tokens };
 };
 
-const login = async (email, password) => {
-  const user = await User.findOne({ email });
-  if (!user) throw new Error("Invalid credentials");
-
-  const match = await bcrypt.compare(password, user.password);
-  if (!match) throw new Error("Invalid credentials");
-
-  const tokens = generateTokens(user);
-  user.refreshToken = tokens.refreshToken;
-  await user.save();
-
-  return { user, ...tokens };
-};
+const login = async (email, password) => {};
 
 const refresh = async (token) => {

[NoCoverage] ObjectLiteral
src/services/authService.js:39:35
 };
 
 const login = async (email, password) => {
-  const user = await User.findOne({ email });
+  const user = await User.findOne({});
   if (!user) throw new Error("Invalid credentials");
 

[NoCoverage] BooleanLiteral
src/services/authService.js:40:7
 
 const login = async (email, password) => {
   const user = await User.findOne({ email });
-  if (!user) throw new Error("Invalid credentials");
+  if (user) throw new Error("Invalid credentials");
 
   const match = await bcrypt.compare(password, user.password);

[NoCoverage] ConditionalExpression
src/services/authService.js:40:7
 
 const login = async (email, password) => {
   const user = await User.findOne({ email });
-  if (!user) throw new Error("Invalid credentials");
+  if (false) throw new Error("Invalid credentials");
 
   const match = await bcrypt.compare(password, user.password);

[NoCoverage] ConditionalExpression
src/services/authService.js:43:7
   if (!user) throw new Error("Invalid credentials");
 
   const match = await bcrypt.compare(password, user.password);
-  if (!match) throw new Error("Invalid credentials");
+  if (false) throw new Error("Invalid credentials");
 
   const tokens = generateTokens(user);

[NoCoverage] BooleanLiteral
src/services/authService.js:43:7
   if (!user) throw new Error("Invalid credentials");
 
   const match = await bcrypt.compare(password, user.password);
-  if (!match) throw new Error("Invalid credentials");
+  if (match) throw new Error("Invalid credentials");
 
   const tokens = generateTokens(user);

[NoCoverage] BlockStatement
src/services/authService.js:52:34
   return { user, ...tokens };
 };
 
-const refresh = async (token) => {
-  const decoded = jwt.verify(token, process.env.JWT_REFRESH_SECRET);
-  const user = await User.findById(decoded.id);
-
-  const tokens = generateTokens(user);
-  user.refreshToken = tokens.refreshToken;
-  await user.save();
-
-  return tokens;
-};
+const refresh = async (token) => {};
 
 const logout = async (userId) => {

[NoCoverage] BlockStatement
src/services/authService.js:63:34
   return tokens;
 };
 
-const logout = async (userId) => {
-  await User.findByIdAndUpdate(userId, { refreshToken: null });
-};
+const logout = async (userId) => {};
 
 module.exports = { register, login, refresh, logout };
