[NoCoverage] BlockStatement
src/services/workoutService.js:4:38
 const WorkoutPlan = require("../models/WorkoutPlan");
 const WorkoutLog = require("../models/WorkoutLog");
 
-const generateMuscleGainPlan = () => {
-  return [
-    { dayNumber: 1, dayName: "Monday", label: "Leg Day", isRest: false, estDuration: 55 },
-    { dayNumber: 2, dayName: "Tuesday", label: "Arms", isRest: false, estDuration: 45 },
-    { dayNumber: 3, dayName: "Wednesday", label: "Chest + Triceps", isRest: false, estDuration: 60 },
-    { dayNumber: 4, dayName: "Thursday", label: "Rest", isRest: true },
-    { dayNumber: 5, dayName: "Friday", label: "Back + Biceps", isRest: false, estDuration: 65 },
-    { dayNumber: 6, dayName: "Saturday", label: "Shoulders", isRest: false, estDuration: 50 },
-    { dayNumber: 7, dayName: "Sunday", label: "Rest", isRest: true }
-  ];
-};
+const generateMuscleGainPlan = () => {};
 
 const getPlan = async (user) => {

[NoCoverage] BooleanLiteral
src/services/workoutService.js:6:66
 
 const generateMuscleGainPlan = () => {
   return [
-    { dayNumber: 1, dayName: "Monday", label: "Leg Day", isRest: false, estDuration: 55 },
+    { dayNumber: 1, dayName: "Monday", label: "Leg Day", isRest: true, estDuration: 55 },
     { dayNumber: 2, dayName: "Tuesday", label: "Arms", isRest: false, estDuration: 45 },
     { dayNumber: 3, dayName: "Wednesday", label: "Chest + Triceps", isRest: false, estDuration: 60 },

[NoCoverage] StringLiteral
src/services/workoutService.js:6:30
 
 const generateMuscleGainPlan = () => {
   return [
-    { dayNumber: 1, dayName: "Monday", label: "Leg Day", isRest: false, estDuration: 55 },
+    { dayNumber: 1, dayName: "", label: "Leg Day", isRest: false, estDuration: 55 },
     { dayNumber: 2, dayName: "Tuesday", label: "Arms", isRest: false, estDuration: 45 },
     { dayNumber: 3, dayName: "Wednesday", label: "Chest + Triceps", isRest: false, estDuration: 60 },

[NoCoverage] BooleanLiteral
src/services/workoutService.js:7:64
 const generateMuscleGainPlan = () => {
   return [
     { dayNumber: 1, dayName: "Monday", label: "Leg Day", isRest: false, estDuration: 55 },
-    { dayNumber: 2, dayName: "Tuesday", label: "Arms", isRest: false, estDuration: 45 },
+    { dayNumber: 2, dayName: "Tuesday", label: "Arms", isRest: true, estDuration: 45 },
     { dayNumber: 3, dayName: "Wednesday", label: "Chest + Triceps", isRest: false, estDuration: 60 },
     { dayNumber: 4, dayName: "Thursday", label: "Rest", isRest: true },

[NoCoverage] StringLiteral
src/services/workoutService.js:7:48
 const generateMuscleGainPlan = () => {
   return [
     { dayNumber: 1, dayName: "Monday", label: "Leg Day", isRest: false, estDuration: 55 },
-    { dayNumber: 2, dayName: "Tuesday", label: "Arms", isRest: false, estDuration: 45 },
+    { dayNumber: 2, dayName: "Tuesday", label: "", isRest: false, estDuration: 45 },
     { dayNumber: 3, dayName: "Wednesday", label: "Chest + Triceps", isRest: false, estDuration: 60 },
     { dayNumber: 4, dayName: "Thursday", label: "Rest", isRest: true },

[NoCoverage] BooleanLiteral
src/services/workoutService.js:8:77
   return [
     { dayNumber: 1, dayName: "Monday", label: "Leg Day", isRest: false, estDuration: 55 },
     { dayNumber: 2, dayName: "Tuesday", label: "Arms", isRest: false, estDuration: 45 },
-    { dayNumber: 3, dayName: "Wednesday", label: "Chest + Triceps", isRest: false, estDuration: 60 },
+    { dayNumber: 3, dayName: "Wednesday", label: "Chest + Triceps", isRest: true, estDuration: 60 },
     { dayNumber: 4, dayName: "Thursday", label: "Rest", isRest: true },
     { dayNumber: 5, dayName: "Friday", label: "Back + Biceps", isRest: false, estDuration: 65 },

[NoCoverage] BooleanLiteral
src/services/workoutService.js:9:65
     { dayNumber: 1, dayName: "Monday", label: "Leg Day", isRest: false, estDuration: 55 },
     { dayNumber: 2, dayName: "Tuesday", label: "Arms", isRest: false, estDuration: 45 },
     { dayNumber: 3, dayName: "Wednesday", label: "Chest + Triceps", isRest: false, estDuration: 60 },
-    { dayNumber: 4, dayName: "Thursday", label: "Rest", isRest: true },
+    { dayNumber: 4, dayName: "Thursday", label: "Rest", isRest: false },
     { dayNumber: 5, dayName: "Friday", label: "Back + Biceps", isRest: false, estDuration: 65 },
     { dayNumber: 6, dayName: "Saturday", label: "Shoulders", isRest: false, estDuration: 50 },

[NoCoverage] StringLiteral
src/services/workoutService.js:9:49
     { dayNumber: 1, dayName: "Monday", label: "Leg Day", isRest: false, estDuration: 55 },
     { dayNumber: 2, dayName: "Tuesday", label: "Arms", isRest: false, estDuration: 45 },
     { dayNumber: 3, dayName: "Wednesday", label: "Chest + Triceps", isRest: false, estDuration: 60 },
-    { dayNumber: 4, dayName: "Thursday", label: "Rest", isRest: true },
+    { dayNumber: 4, dayName: "Thursday", label: "", isRest: true },
     { dayNumber: 5, dayName: "Friday", label: "Back + Biceps", isRest: false, estDuration: 65 },
     { dayNumber: 6, dayName: "Saturday", label: "Shoulders", isRest: false, estDuration: 50 },

[NoCoverage] BooleanLiteral
src/services/workoutService.js:10:72
     { dayNumber: 2, dayName: "Tuesday", label: "Arms", isRest: false, estDuration: 45 },
     { dayNumber: 3, dayName: "Wednesday", label: "Chest + Triceps", isRest: false, estDuration: 60 },
     { dayNumber: 4, dayName: "Thursday", label: "Rest", isRest: true },
-    { dayNumber: 5, dayName: "Friday", label: "Back + Biceps", isRest: false, estDuration: 65 },
+    { dayNumber: 5, dayName: "Friday", label: "Back + Biceps", isRest: true, estDuration: 65 },
     { dayNumber: 6, dayName: "Saturday", label: "Shoulders", isRest: false, estDuration: 50 },
     { dayNumber: 7, dayName: "Sunday", label: "Rest", isRest: true }

[NoCoverage] ObjectLiteral
src/services/workoutService.js:10:5
     { dayNumber: 2, dayName: "Tuesday", label: "Arms", isRest: false, estDuration: 45 },
     { dayNumber: 3, dayName: "Wednesday", label: "Chest + Triceps", isRest: false, estDuration: 60 },
     { dayNumber: 4, dayName: "Thursday", label: "Rest", isRest: true },
-    { dayNumber: 5, dayName: "Friday", label: "Back + Biceps", isRest: false, estDuration: 65 },
+    {},
     { dayNumber: 6, dayName: "Saturday", label: "Shoulders", isRest: false, estDuration: 50 },
     { dayNumber: 7, dayName: "Sunday", label: "Rest", isRest: true }

[NoCoverage] BooleanLiteral
src/services/workoutService.js:11:70
     { dayNumber: 3, dayName: "Wednesday", label: "Chest + Triceps", isRest: false, estDuration: 60 },
     { dayNumber: 4, dayName: "Thursday", label: "Rest", isRest: true },
     { dayNumber: 5, dayName: "Friday", label: "Back + Biceps", isRest: false, estDuration: 65 },
-    { dayNumber: 6, dayName: "Saturday", label: "Shoulders", isRest: false, estDuration: 50 },
+    { dayNumber: 6, dayName: "Saturday", label: "Shoulders", isRest: true, estDuration: 50 },
     { dayNumber: 7, dayName: "Sunday", label: "Rest", isRest: true }
   ];

[NoCoverage] StringLiteral
src/services/workoutService.js:11:49
     { dayNumber: 3, dayName: "Wednesday", label: "Chest + Triceps", isRest: false, estDuration: 60 },
     { dayNumber: 4, dayName: "Thursday", label: "Rest", isRest: true },
     { dayNumber: 5, dayName: "Friday", label: "Back + Biceps", isRest: false, estDuration: 65 },
-    { dayNumber: 6, dayName: "Saturday", label: "Shoulders", isRest: false, estDuration: 50 },
+    { dayNumber: 6, dayName: "Saturday", label: "", isRest: false, estDuration: 50 },
     { dayNumber: 7, dayName: "Sunday", label: "Rest", isRest: true }
   ];

[NoCoverage] BooleanLiteral
src/services/workoutService.js:12:63
     { dayNumber: 4, dayName: "Thursday", label: "Rest", isRest: true },
     { dayNumber: 5, dayName: "Friday", label: "Back + Biceps", isRest: false, estDuration: 65 },
     { dayNumber: 6, dayName: "Saturday", label: "Shoulders", isRest: false, estDuration: 50 },
-    { dayNumber: 7, dayName: "Sunday", label: "Rest", isRest: true }
+    { dayNumber: 7, dayName: "Sunday", label: "Rest", isRest: false }
   ];
 };

[NoCoverage] StringLiteral
src/services/workoutService.js:12:30
     { dayNumber: 4, dayName: "Thursday", label: "Rest", isRest: true },
     { dayNumber: 5, dayName: "Friday", label: "Back + Biceps", isRest: false, estDuration: 65 },
     { dayNumber: 6, dayName: "Saturday", label: "Shoulders", isRest: false, estDuration: 50 },
-    { dayNumber: 7, dayName: "Sunday", label: "Rest", isRest: true }
+    { dayNumber: 7, dayName: "", label: "Rest", isRest: true }
   ];
 };

[NoCoverage] BlockStatement
src/services/workoutService.js:16:33
   ];
 };
 
-const getPlan = async (user) => {
-  let plan = await WorkoutPlan.findOne({ user, active: true });
-
-  if (!plan) {
-    const days = generateMuscleGainPlan();
-    plan = await WorkoutPlan.create({ user, days, active: true });
-  }
-
-  return plan;
-};
+const getPlan = async (user) => {};
 
 const regenPlan = async (user) => {

[NoCoverage] BooleanLiteral
src/services/workoutService.js:17:56
 };
 
 const getPlan = async (user) => {
-  let plan = await WorkoutPlan.findOne({ user, active: true });
+  let plan = await WorkoutPlan.findOne({ user, active: false });
 
   if (!plan) {

[NoCoverage] ObjectLiteral
src/services/workoutService.js:17:40
 };
 
 const getPlan = async (user) => {
-  let plan = await WorkoutPlan.findOne({ user, active: true });
+  let plan = await WorkoutPlan.findOne({});
 
   if (!plan) {

[NoCoverage] ConditionalExpression
src/services/workoutService.js:19:7
 const getPlan = async (user) => {
   let plan = await WorkoutPlan.findOne({ user, active: true });
 
-  if (!plan) {
+  if (false) {
     const days = generateMuscleGainPlan();
     plan = await WorkoutPlan.create({ user, days, active: true });

[NoCoverage] BlockStatement
src/services/workoutService.js:19:14
 const getPlan = async (user) => {
   let plan = await WorkoutPlan.findOne({ user, active: true });
 
-  if (!plan) {
-    const days = generateMuscleGainPlan();
-    plan = await WorkoutPlan.create({ user, days, active: true });
-  }
+  if (!plan) {}
 
   return plan;

[NoCoverage] BooleanLiteral
src/services/workoutService.js:21:59
 
   if (!plan) {
     const days = generateMuscleGainPlan();
-    plan = await WorkoutPlan.create({ user, days, active: true });
+    plan = await WorkoutPlan.create({ user, days, active: false });
   }
 

[NoCoverage] BlockStatement
src/services/workoutService.js:27:35
   return plan;
 };
 
-const regenPlan = async (user) => {
-  await WorkoutPlan.updateMany({ user }, { active: false });
-
-  const days = generateMuscleGainPlan();
-  const plan = await WorkoutPlan.create({ user, days, active: true });
-
-  return plan;
-};
+const regenPlan = async (user) => {};
 
 const logWorkout = async (user, data) => {

[NoCoverage] BooleanLiteral
src/services/workoutService.js:28:52
 };
 
 const regenPlan = async (user) => {
-  await WorkoutPlan.updateMany({ user }, { active: false });
+  await WorkoutPlan.updateMany({ user }, { active: true });
 
   const days = generateMuscleGainPlan();

[NoCoverage] ObjectLiteral
src/services/workoutService.js:28:32
 };
 
 const regenPlan = async (user) => {
-  await WorkoutPlan.updateMany({ user }, { active: false });
+  await WorkoutPlan.updateMany({}, { active: false });
 
   const days = generateMuscleGainPlan();

[NoCoverage] BooleanLiteral
src/services/workoutService.js:31:63
   await WorkoutPlan.updateMany({ user }, { active: false });
 
   const days = generateMuscleGainPlan();
-  const plan = await WorkoutPlan.create({ user, days, active: true });
+  const plan = await WorkoutPlan.create({ user, days, active: false });
 
   return plan;

[NoCoverage] BlockStatement
src/services/workoutService.js:36:42
   return plan;
 };
 
-const logWorkout = async (user, data) => {
-  const log = await WorkoutLog.create({ user, ...data });
-  return log;
-};
+const logWorkout = async (user, data) => {};
 
 const getLogs = async (user) => {

[NoCoverage] BlockStatement
src/services/workoutService.js:41:33
   return log;
 };
 
-const getLogs = async (user) => {
-  return await WorkoutLog.find({ user }).sort({ createdAt: -1 });
-};
+const getLogs = async (user) => {};
 
 const updateLog = async (id, data) => {

[NoCoverage] MethodExpression
src/services/workoutService.js:42:16
 };
 
 const getLogs = async (user) => {
-  return await WorkoutLog.find({ user }).sort({ createdAt: -1 });
+  return await WorkoutLog.find({
+  user
+});
 };
 

[NoCoverage] UnaryOperator
src/services/workoutService.js:42:60
 };
 
 const getLogs = async (user) => {
-  return await WorkoutLog.find({ user }).sort({ createdAt: -1 });
+  return await WorkoutLog.find({ user }).sort({ createdAt: +1 });
 };
 

[NoCoverage] BlockStatement
src/services/workoutService.js:45:39
   return await WorkoutLog.find({ user }).sort({ createdAt: -1 });
 };
 
-const updateLog = async (id, data) => {
-  const log = await WorkoutLog.findByIdAndUpdate(id, data, { new: true });
-  if (!log) throw new Error("Log not found");
-  return log;
-};
+const updateLog = async (id, data) => {};
 
 const deleteLog = async (id) => {

[NoCoverage] BooleanLiteral
src/services/workoutService.js:46:67
 };
 
 const updateLog = async (id, data) => {
-  const log = await WorkoutLog.findByIdAndUpdate(id, data, { new: true });
+  const log = await WorkoutLog.findByIdAndUpdate(id, data, { new: false });
   if (!log) throw new Error("Log not found");
   return log;

[NoCoverage] ObjectLiteral
src/services/workoutService.js:46:60
 };
 
 const updateLog = async (id, data) => {
-  const log = await WorkoutLog.findByIdAndUpdate(id, data, { new: true });
+  const log = await WorkoutLog.findByIdAndUpdate(id, data, {});
   if (!log) throw new Error("Log not found");
   return log;

[NoCoverage] ConditionalExpression
src/services/workoutService.js:47:7
 
 const updateLog = async (id, data) => {
   const log = await WorkoutLog.findByIdAndUpdate(id, data, { new: true });
-  if (!log) throw new Error("Log not found");
+  if (false) throw new Error("Log not found");
   return log;
 };

[NoCoverage] BooleanLiteral
src/services/workoutService.js:47:7
 
 const updateLog = async (id, data) => {
   const log = await WorkoutLog.findByIdAndUpdate(id, data, { new: true });
-  if (!log) throw new Error("Log not found");
+  if (log) throw new Error("Log not found");
   return log;
 };

[NoCoverage] BlockStatement
src/services/workoutService.js:51:33
   return log;
 };
 
-const deleteLog = async (id) => {
-  await WorkoutLog.findByIdAndDelete(id);
-};
+const deleteLog = async (id) => {};
 
 module.exports = { getPlan, regenPlan, logWorkout, getLogs, updateLog, deleteLog };
